{
  "backend/main.mo": "Backend actor managing paintings, user profiles, authorization, ratings, and blob storage with CRUD methods and access checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend files for reference or documentation.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with authentication-aware layout, profile gating, and route definitions.",
  "frontend/src/components/draw/ColorPalette.tsx": "Color picker component with preset swatches and custom color input for the drawing tools.",
  "frontend/src/components/draw/DrawingCanvas.tsx": "HTML5 canvas component providing drawing tools, undo history, and PNG export logic.",
  "frontend/src/components/draw/ToolBar.tsx": "UI toolbar for selecting drawing tools, adjusting size and opacity, and triggering undo.",
  "frontend/src/components/gallery/PaintingCard.tsx": "Displays a painting with image, title, date, share button, and rating info, and handles click navigation.",
  "frontend/src/components/gallery/PaintingGrid.tsx": "Renders a responsive masonry-like grid of PaintingCard components with navigation on click.",
  "frontend/src/components/gallery/PaintingImage.tsx": "Loads and displays a painting image using its direct URL.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with app logo navigation and logout handling that clears identity and cache.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for entering and saving a user name during profile setup with validation and loading state.",
  "frontend/src/components/ratings/RatingControl.tsx": "Star-based rating widget allowing users to rate a painting and view their current rating.",
  "frontend/src/components/share/ShareButton.tsx": "Share button that uses Web Share API or copies the painting link to clipboard.",
  "frontend/src/hooks/mutations/useCompletePainting.ts": "Mutation hook to submit a completed painting and refresh the gallery cache.",
  "frontend/src/hooks/queries/useCallerProfile.ts": "Hooks for fetching and saving the current user's profile via the backend actor.",
  "frontend/src/hooks/queries/useGallery.ts": "Hooks to fetch the full gallery and retrieve a specific painting from cached results.",
  "frontend/src/hooks/queries/useRatings.ts": "Hooks for fetching painting ratings, computing user and average ratings, and submitting new ratings.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor instance based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorStatus.ts": "Reads actor initialization status from cache without refetching to report readiness or errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides current user identity info and utility to check ownership by principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, stored identity restoration, and status flags.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme color variables for light/dark modes, and utility classes for consistent UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a welcome/sign‑in screen or authenticated dashboard with navigation to drawing and gallery pages.",
  "frontend/src/pages/DrawPage.tsx": "Provides a drawing interface with tools, color controls, and save functionality, ensuring authentication and backend actor readiness.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of paintings fetched from the backend, handling loading states and requiring authentication.",
  "frontend/src/pages/PaintingDetailPage.tsx": "Displays a single painting with metadata, ratings, and sharing options, redirecting unauthenticated users and handling missing data.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with custom plugins.",
  "project_state.json": "Project metadata describing implemented ICP dapp features, versions, and current scaffold capabilities."
}